Revit API Introduction Labs
LabUtils.GetParameterValue Method
 Helper to return parameter value as string. One can also use param.AsValueString() to get the user interface representation.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static string GetParameterValue(
	Parameter param
)
Visual Basic (Declaration)
Public Shared Function GetParameterValue ( _
	param As Parameter _
) As String
Visual C++
public:
static String^ GetParameterValue(
	Parameter^ param
)
Parameters
param
Type: Parameter
See Also
LabUtils Class
Labs Namespace